function [t, y] = Adams(t_0, h, t_n, y_0, A)% t_0 - первый узел, h - шаг, t_n - последний узел, y_0 - начальное условие, A - матрица
    s = rank(A);
    t = t_0:h:t_n;
    y = zeros(s, length(t));
    y(:,1) = y_0;
    [~,y_2] = RK(t_0, h, t_0+h,y_0,A);%использование метода Рунге-Кутты для нахождения y(t_0+h)
    y(:,2) = y_2(:,2);
    [~,y_3] = RK(t_0+h, h, t_0+2*h,y(:,2),A);%использование метода Рунге-Кутты для нахождения y(t_0+2h)
    y(:,3) = y_3(:,2);
    for k = 3:length(t)-1
        y_pred = y(:,k) + A*h*(23*y(:,k) - 16*y(:,k-1)+5*y(:,k-2))/12;%использование метода Адамса-Башфорта, для прогноза
        y(:,k+1) = y(:,(k)) + A*h*(5*y_pred + 8*y(:,(k)) - y(:,(k-1)))/12;%использование метода Адамса - Мултона, для получение конечного ответа
    end
end
    
